toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
    // Prep the element if this is the first instance
    if (!hist->count) {
        hist->type = {
            .domain = domain,
            .line = line,
        };
        
        hist->timestampEarliest = timestamp;
    }
    
    hist->timestampLatest = timestamp;
    hist->count++;
}

[[noreturn]]
static void _BOR() {
    PMMUnlock pmm; // Unlock PMM registers
    PMMCTL0_L |= PMMSWBOR_L;
    // Wait for reset
    for (;;);
}

[[noreturn]]
static void _Abort(uint16_t domain, uint16_t line) {
    const MSP::Time timestamp = _RTC::TimeRead();
    // Record the abort
    _AbortRecord(timestamp, domain, line);
    _BOR();
}

extern "C" [[noreturn]]
void abort() {
    Assert(false);
}

// MARK: - Main

//static void _HostMode() {
//    // Let power rails fully discharge before turning them on
//    _Scheduler::Delay(_Scheduler::Ms(10));
//    
//    while (!_Pin::HOST_MODE_::Read()) {
//        _Scheduler::Delay(_Scheduler::Ms(100));
//    }
//}

//extern "C" void Blink() {
//    for (;;) {
//        _Pin::LED_GREEN_::Write(0);
//        for (volatile uint16_t i=0; i<50000; i++);
//        _Pin::LED_GREEN_::Write(1);
//        for (volatile uint16_t i=0; i<50000; i++);
//    }
//}

int main() {
    // Stop watchdog timer
    WDTCTL = WDTPW | WDTHOLD;
    
    // Init GPIOs
    GPIO::Init<
        // General IO
        _Pin::MOTION_SIGNAL,
        _Pin::LED_GREEN_,
        _Pin::LED_RED_,
        _Pin::MOTION_EN_,
        _Pin::VDD_B_EN,
        
        // Power control
        _Pin::VDD_B_1V8_IMG_SD_EN,
        _Pin::VDD_B_2V8_IMG_SD_EN,
        
        // Clock (config chosen by _RTCType)
        _RTC::Pin::XOUT,
        _RTC::Pin::XIN,
        
        // SPI (config chosen by _SPI)
        _SPI::Pin::Clk,
        _SPI::Pin::DataOut,
        _SPI::Pin::DataIn,
        
        // I2C (config chosen by _I2C)
        _I2C::Pin::SCL,
        _I2C::Pin::SDA,
        _I2C::Pin::Active,
        
        // Battery (config chosen by _BatterySampler)
        _BatterySampler::Pin::BatChrgLvlPin,
        _BatterySampler::Pin::BatChrgLvlEn_Pin,
        
        // Button
        _Button::Pin
    >();
    
    // Init clock
    _Clock::Init();
    
    // Init RTC
    // We need RTC to be unconditionally enabled for 2 reasons:
    //   - We want to track relative time (ie system uptime) even if we don't know the wall time.
    //   - RTC must be enabled to keep BAKMEM alive when sleeping. If RTC is disabled, we enter
    //     LPM4.5 when we sleep (instead of LPM3.5), and BAKMEM is lost.
    _RTC::Init();
    
    // Init SysTick
    _SysTick::Init();
    
    // Init _BatterySampler
    _BatterySampler::Init();
    
    // Init LEDs by setting their default-priority / 'backstop' values to off.
    // This is necessary so that relinquishing the LEDs from I2C task causes
    // them to turn off. If we didn't have a backstop value, the LEDs would
    // remain in whatever state the I2C task set them to before relinquishing.
    _LEDGreen_::Set(_LEDPriority::Default, 1);
    _LEDRed_::Set(_LEDPriority::Default, 1);
    
//    // Blink green LED to signal that we're turning off
//    for (;;) {
//        for (int i=0; i<5; i++) {
//            _Pin::LED_GREEN_::Write(0);
//            for (volatile int i=0; i<0xFFFF; i++);
//            _Pin::LED_GREEN_::Write(1);
//            for (volatile int i=0; i<0xFFFF; i++);
//        }
//    }
    
//    _Scheduler::Start<_TaskButton>();
    _Scheduler::Start<_TaskButton, _TaskI2C>();
    _Scheduler::Run();
}
